{
  "meta": {
    "themeOptions": {
      "colors": {
        "background": ["#ffffff", "#191e23"],
        "dimmed": ["#f3f4f5", "#23282d"],
        "primary": ["#191e23", "#fbfbfc"],
        "secondary": ["#6c7781", "#ccd0d4"],
        "accent": ["#46b450", "#47d153"]
      }
    },
    "theme": "even"
  },
  "basics": {
    "name": "Jake Gaylor",
    "label": "Senior Software Engineer & Product Founder | End-to-End Product Development & Go-to-Market",
    "image": "",
    "email": "jhgaylor@gmail.com",
    "phone": "720.453.3994",
    "url": "https://jakegaylor.com",
    "summary": "15+ years building and shipping products at scale—from founding SaaS ventures to architecting AI-powered platforms. I combine deep SWE expertise with business leadership to drive product vision, go-to-market strategy, and revenue growth.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "US",
      "region": "Remote First, Will Travel"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jhgaylor",
        "url": "https://github.com/jhgaylor"
      },
      {
        "network": "LinkedIn",
        "username": "jhgaylor",
        "url": "https://www.linkedin.com/in/jhgaylor/"
      }
    ]
  },
  "work": [
    {
      "name": "Cloaked Inc",
      "position": "Staff SWE, Office of the CEO",
      "url": "https://cloaked.app",
      "startDate": "2023-08",
      "summary": "Spearheaded executive-level innovation by developing autonomous AI agents and a cross-functional ideation portal—driving a highly sticky, AI-powered onboarding experience that boosted user adoption and retention and defined governance processes",
      "highlights": [
        "Developed autonomous AI agents using LangChain to automate user account management tasks such as auto change password, auto login, and auto change email",
        "Leveraged these AI agents as a core fundraising narrative and created a highly sticky, AI-powered onboarding experience that significantly boosted user adoption and retention",
        "Designed and launched a cross-functional ideation portal engaging design, customer success, engineering, product development, and executive teams with transparent status tracking",
        "Partnered with design, product, engineering, marketing, customer success, and co-founders to validate, refine, and ship concepts into market-ready features",
        "Defined and documented cross-functional roles, ceremonies, and governance processes to unify ideation and accelerate product delivery across the organization"
      ]
    },
    {
      "name": "Cloaked Inc",
      "position": "Staff Platform Engineer",
      "url": "https://cloaked.app",
      "startDate": "2022-09",
      "endDate": "2023-08",
      "summary": "Oversaw strategic AWS EKS migration and architected enterprise deployment governance, compliance frameworks, and GitOps CI/CD pipelines to enhance security, scalability, and developer productivity",
      "highlights": [
        "Defined and executed a strategic migration roadmap transitioning legacy PaaS platforms to AWS EKS, driving cost reduction and scalability",
        "Collaborated with cross-functional leadership to implement a Cloudflare control plane, enhancing security posture and resilience",
        "Architected and led adoption of a multi-account AWS hub-and-spoke model, ensuring SOC2, ISO 27001, and 27701 compliance",
        "Established enterprise Kubernetes and edge deployment standards, mentoring engineering teams in best practices and governance",
        "Spearheaded design and implementation of a GitOps-based CI/CD pipeline, accelerating deployments by 30x",
        "Partnered with product and analytics teams to develop an end-to-end analytics stack, enabling data-driven decision-making"
      ]
    },
    {
      "name": "The Onward Store Steakhouse",
      "position": "Owner / Co-GM",
      "startDate": "2021-10",
      "endDate": "2024-01",
      "summary": "Owned and managed a full-service steakhouse with 7 staff, generating $500K in annual revenue and overseeing P&L, operations, and vendor relations.",
      "highlights": [
        "Led a team of 7 employees, handling recruitment, training, scheduling, and performance management.",
        "Directed all facets of business operations, achieving $500K in annual revenue through strategic inventory management and cost control.",
        "Designed and implemented operational processes for facility maintenance, vendor partnerships, and quality assurance, driving consistent customer satisfaction.",
        "Managed P&L, budgets, and financial reporting, optimizing expenses and improving profit margins.",
        "Executed marketing and community engagement initiatives to increase local brand awareness and repeat patronage."
      ]
    },
    {
      "name": "Inception Health",
      "position": "Staff SWE in Developer Experience",
      "startDate": "2020-06",
      "endDate": "2022-06",
      "summary": "Architected AWS CDK infrastructure and tooling for HIPAA-compliant patient care microservices",
      "highlights": [
        "Led delivery of AWS CDK infrastructure for patient care microservices platform, ensuring HIPAA compliance and deep AWS integration",
        "Collaborated with AWS and partner teams to integrate managed services and accelerate platform development",
        "Championed CDK usage across application tiers, designing IaC patterns for teams to consume and interact with the platform",
        "Implemented CI/CD pipelines for mobile apps, automating TestFlight and App Store releases through Git, enabling self-serve deployments",
        "Trained and mentored product and mobile development teams on CDK, serverless architectures, and CI/CD workflows, fostering autonomy"
      ]
    },
    {
      "name": "CyberGRX (now ProcessUnity)",
      "position": "Senior Platform Engineer",
      "url": "https://www.cybergrx.com",
      "startDate": "2018-12",
      "endDate": "2020-06",
      "summary": "Led cloud-native CI/CD vision and implementation for AWS and Kubernetes",
      "highlights": [
        "Led vision on cloud-native CI/CD pipelines for AWS and Kubernetes",
        "Developed custom resource using CoreOS operator SDK for orchestrating blue/green deployments",
        "Redesigned build and deploy process that dramatically improved team productivity",
        "Mentored software engineers in best practices for building and deploying software",
        "Grew into Staff Engineer role by owning large-scope initiatives, collaborating with the Tech Lead to drive interactions across the organization and unblock progress"
      ]
    },
    {
      "name": "Cardfree",
      "position": "Senior Cloud Platform Engineer",
      "startDate": "2018-01",
      "endDate": "2018-12",
      "summary": "Managed large-scale PCI-compliant C# installation in AWS",
      "highlights": [
        "Managed a large-scale PCI-compliant C# installation in AWS",
        "Architected hybrid AMI build and deploy platform using Packer and Vagrant, enabling consistent Windows and Linux EC2 deployments for C# and Ruby services",
        "Standardized infrastructure-as-code practices to pave the way for open-source .NET migration",
        "Developed and launched a structured PCI-compliant incident response program, replacing ad-hoc Slack alerts with a streamlined IR workflow without excessive paperwork"
      ]
    },
    {
      "name": "Protectwise, Inc (Acquired by Verizon)",
      "position": "Senior DevOps Engineer",
      "startDate": "2016-08",
      "endDate": "2018-01",
      "summary": "Operated SRE for petabyte-scale data ingestion platform",
      "highlights": [
        "Managed SRE for massive scale data ingestion platform with thousands of Cassandra nodes and petabytes in S3",
        "Administered $10M+/yr production AWS environment using Infrastructure as Code"
      ]
    },
    {
      "name": "Food Service Warehouse",
      "position": "DevOps Engineer",
      "startDate": "2015-06",
      "endDate": "2016-03",
      "summary": "Built Kubernetes clusters on vSphere using CoreOS technologies",
      "highlights": [
        "Implemented Kubernetes clusters on vSphere using CoreOS, fleet, etcd, and flannel",
        "Accelerated release cycles for Node.js services with container orchestration"
      ]
    },
    {
      "name": "Mississippi State University",
      "position": "Software Developer",
      "startDate": "2010-06",
      "endDate": "2014-06",
      "summary": "Created grant proposals and custom software for research initiatives",
      "highlights": [
        "Created grant proposals to fund custom software for university research initiatives",
        "Developed software for tracking 'human sensors' through natural disasters including Hurricane Sandy"
      ]
    }
  ],
  "volunteer": [],
  "education": [],
  "awards": [],
  "certificates": [],
  "publications": [],
  "skills": [
    {
      "name": "AI Engineering",
      "level": "Advanced",
      "keywords": [
        "LangChain",
        "Crewai",
        "Custom Agent Framework",
        "MCP Servers",
        "LLM Integration"
      ]
    },
    {
      "name": "Cloud Infrastructure",
      "level": "Expert",
      "keywords": [
        "AWS",
        "Kubernetes",
        "EKS",
        "GKE",
        "vSphere",
        "Terraform",
        "Infrastructure as Code",
        "Cloudflare"
      ]
    },
    {
      "name": "CI/CD & DevOps",
      "level": "Expert",
      "keywords": [
        "GitOps",
        "ArgoCD",
        "Argo Workflows",
        "Jenkins",
        "Github Actions",
        "Gitlab CI",
        "Continuous Deployment"
      ]
    },
    {
      "name": "Programming Languages",
      "level": "Advanced",
      "keywords": [
        "Javascript",
        "Python",
        "Bash",
        "Go",
        "Ruby",
        "Dart"
      ]
    },
    {
      "name": "Databases",
      "level": "Advanced",
      "keywords": [
        "Neo4j",
        "PostgreSQL",
        "Timestream",
        "MongoDB",
        "Redis",
        "Etcd",
        "Zookeeper",
        "Cassandra",
        "DynamoDB"
      ]
    },
    {
      "name": "Distributed Systems",
      "level": "Expert",
      "keywords": [
        "Kafka",
        "RabbitMQ",
        "AWS IoT",
        "Big Data",
        "Spark",
        "EMR"
      ]
    },
    {
      "name": "Monitoring",
      "level": "Advanced",
      "keywords": [
        "Prometheus",
        "CloudWatch",
        "Sensu",
        "Pagerduty",
        "Logstash",
        "Kibana",
        "Grafana",
        "Graphite"
      ]
    },
    {
      "name": "Product Engineering",
      "level": "Expert",
      "keywords": [
        "Data-driven Iteration",
        "Feature Development",
        "User Feedback Loops",
        "MVP Development",
        "Product Analytics"
      ]
    },
    {
      "name": "Product & Business",
      "level": "Advanced",
      "keywords": [
        "Roadmapping",
        "Customer Discovery",
        "P&L Management",
        "Go-to-Market Strategy",
        "Fundraising"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": [
    {
      "name": "Director Platform Engineering, Cloaked",
      "reference": "Jake is a force for good unlike any other. He migrated our infra to a cheaper and more scalable system, crafted a CI pipeline that accelerated deploys by 30x, and taught the whole company how to make data-driven decisions by building and showcasing an entire product analytics stack. And that was just his first 6 months."
    },
    {
      "name": "Software Engineer, CyberGRX",
      "reference": "I watched Jake redo a build and deploy process over the span of 3 days, whip up a presentation, and get every engineer in the org up to speed using it to deploy new services, a moment I'll never forget because our productivity EXPLODED afterwards."
    },
    {
      "name": "Senior Platform Engineer, Inception Health",
      "reference": "I also wanted to second (third? Fourth?) Jake's skills here. I don't have anything unique to add as everyone else has already covered it, but this man will help you achieve what you need."
    },
    {
      "name": "Magician, Magic",
      "reference": "Jake worked in the pit with [the operations team] and everyday came in with killer energy. Everyone else told us how to work around problems. Jake built us better tools."
    },
    {
      "name": "DevOps Engineer, Protectwise",
      "reference": "Jake was instrumental in building our cloud-native security platform. His technical leadership helped shape our architecture and team practices."
    }
  ],
  "projects": [
    {
      "name": "MCP Working Group Contributions",
      "description": "Active participant in Model Context Protocol (MCP) community development",
      "highlights": [
        "Member of the MCP Hosting Working Group",
        "Developed strategies for deploying and running MCP servers at scale",
        "Contributed to Dart SDK, Express tool for binding to MCP servers",
        "Developed various MCP servers (Hirebase, Candidate Job Search, Text Extraction)",
        "Created GitOps tool for MCP deployments",
        "Operate publicly available MCP servers for community testing"
      ],
      "url": "https://github.com/jhgaylor"
    },
    {
      "name": "CareerFlick LLM-Driven Mobile App",
      "description": "Developed a mobile application with a Tinder-like LLM interface",
      "highlights": [
        "Built intuitive swipe-based interface for interacting with LLMs",
        "Implemented AI-driven content generation and response system",
        "Created responsive mobile-first user experience"
      ]
    },
    {
      "name": "Hirebase MCP Server",
      "description": "A Python MCP server for Hirebase.org's API",
      "highlights": [
        "Built a Python-based Model Context Protocol (MCP) server for searching jobs on Hirebase.org",
        "Dockerized the service and set up GitOps CI/CD pipelines for automated builds and releases"
      ],
      "url": "https://github.com/jhgaylor/hirebase-mcp"
    },
    {
      "name": "Express MCP Handler",
      "description": "Package to simplify MCP handling in Express.js",
      "highlights": [
        "Developed Express middleware in TypeScript to streamline MCP request handling",
        "Authored full type definitions and robust error handling for production-grade reliability",
        "Configured CI/CD pipelines to automate code validation and package publishing"
      ],
      "url": "https://github.com/jhgaylor/express-mcp-handler"
    },
    {
      "name": "Node Candidate MCP Server",
      "description": "A TypeScript library to build customizable candidate MCP servers",
      "highlights": [
        "Authored a reusable library enabling developers to integrate their own candidate data into MCP flows",
        "Published as an npm package for easy adoption and extension by other teams"
      ],
      "url": "https://github.com/jhgaylor/node-candidate-mcp-server"
    },
    {
      "name": "mcp_dart",
      "description": "Dart SDK implementation of the Model Context Protocol (MCP)",
      "highlights": [
        "Contributed stream based support for in-process MCP servers",
        "Add support for running MCP servers in flutter apps",
        "Authored Dart examples to accelerate SDK adoption"
      ],
      "url": "https://github.com/leehack/mcp_dart"
    }
  ]
}